espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration Register */
/** Type of uart0_conf register
 *  UART0 configuration register
 */
typedef union {
    struct {
        /** uart0_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable uart0 apb clock
         */
        uint32_t uart0_clk_en:1;
        /** uart0_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset uart0 module
         */
        uint32_t uart0_rst_en:1;
        /** uart0_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset uart0 module
         */
        uint32_t uart0_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_uart0_conf_reg_t;

/** Type of uart0_sclk_conf register
 *  UART0_SCLK configuration register
 */
typedef union {
    struct {
        /** uart0_sclk_div_a : R/W; bitpos: [5:0]; default: 0;
         *  The  denominator of the frequency divider factor of the uart0 function clock.
         */
        uint32_t uart0_sclk_div_a:6;
        /** uart0_sclk_div_b : R/W; bitpos: [11:6]; default: 0;
         *  The numerator of the frequency divider factor of the uart0 function clock.
         */
        uint32_t uart0_sclk_div_b:6;
        /** uart0_sclk_div_num : R/W; bitpos: [19:12]; default: 0;
         *  The integral part of the frequency divider factor of the uart0 function clock.
         */
        uint32_t uart0_sclk_div_num:8;
        /** uart0_sclk_sel : R/W; bitpos: [21:20]; default: 0;
         *  Configures the clock source of UART0.
         *  0 (default): XTAL_CLK
         *  1: RC_FAST_CLK
         *  2: PLL_F48M_CLK
         */
        uint32_t uart0_sclk_sel:2;
        /** uart0_sclk_en : R/W; bitpos: [22]; default: 1;
         *  Set 1 to enable uart0 function clock
         */
        uint32_t uart0_sclk_en:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} pcr_uart0_sclk_conf_reg_t;

/** Type of uart0_mem_lp_ctrl register
 *  UART0 memory power control register
 */
typedef union {
    struct {
        /** uart0_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures uart0 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t uart0_mem_lp_mode:2;
        /** uart0_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down uart0 memory.
         */
        uint32_t uart0_mem_lp_en:1;
        /** uart0_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control uart0 memory, disable hardware control.
         */
        uint32_t uart0_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_uart0_mem_lp_ctrl_reg_t;

/** Type of uart1_conf register
 *  UART1 configuration register
 */
typedef union {
    struct {
        /** uart1_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable uart1 apb clock
         */
        uint32_t uart1_clk_en:1;
        /** uart1_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset uart1 module
         */
        uint32_t uart1_rst_en:1;
        /** uart1_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset uart1 module
         */
        uint32_t uart1_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_uart1_conf_reg_t;

/** Type of uart1_sclk_conf register
 *  UART1_SCLK configuration register
 */
typedef union {
    struct {
        /** uart1_sclk_div_a : R/W; bitpos: [5:0]; default: 0;
         *  The  denominator of the frequency divider factor of the uart1 function clock.
         */
        uint32_t uart1_sclk_div_a:6;
        /** uart1_sclk_div_b : R/W; bitpos: [11:6]; default: 0;
         *  The numerator of the frequency divider factor of the uart1 function clock.
         */
        uint32_t uart1_sclk_div_b:6;
        /** uart1_sclk_div_num : R/W; bitpos: [19:12]; default: 0;
         *  The integral part of the frequency divider factor of the uart1 function clock.
         */
        uint32_t uart1_sclk_div_num:8;
        /** uart1_sclk_sel : R/W; bitpos: [21:20]; default: 0;
         *  Configures the clock source of UART1.
         *  0 (default): XTAL_CLK
         *  1: RC_FAST_CLK
         *  2: PLL_F48M_CLK
         */
        uint32_t uart1_sclk_sel:2;
        /** uart1_sclk_en : R/W; bitpos: [22]; default: 1;
         *  Set 1 to enable uart0 function clock
         */
        uint32_t uart1_sclk_en:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} pcr_uart1_sclk_conf_reg_t;

/** Type of uart1_mem_lp_ctrl register
 *  UART1 memory power control register
 */
typedef union {
    struct {
        /** uart1_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures uart1 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t uart1_mem_lp_mode:2;
        /** uart1_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down uart1 memory.
         */
        uint32_t uart1_mem_lp_en:1;
        /** uart1_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control uart1 memory, disable hardware control.
         */
        uint32_t uart1_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_uart1_mem_lp_ctrl_reg_t;

/** Type of mspi_conf register
 *  MSPI configuration register
 */
typedef union {
    struct {
        /** mspi_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable mspi apb clock and mspi pll clock
         */
        uint32_t mspi_clk_en:1;
        /** mspi_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset mspi module
         */
        uint32_t mspi_rst_en:1;
        /** mspi_pll_clk_en : R/W; bitpos: [2]; default: 1;
         *  Set 1 to enable mspi pll clock
         */
        uint32_t mspi_pll_clk_en:1;
        /** mspi_ready : RO; bitpos: [3]; default: 1;
         *  Query this field after reset mspi module
         */
        uint32_t mspi_ready:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_mspi_conf_reg_t;

/** Type of mspi_clk_conf register
 *  MSPI_CLK configuration register
 */
typedef union {
    struct {
        /** mspi_fast_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Set as one within (0,1,2) to generate div1(default)/div2/div4 of low-speed
         *  clock-source to drive clk_mspi_fast. Only available when the clck-source is a
         *  low-speed clock-source such as XTAL/FOSC.
         */
        uint32_t mspi_fast_div_num:8;
        /** mspi_func_clk_sel : R/W; bitpos: [9:8]; default: 0;
         *  Configures the clock source for MSPI.
         *  0(default): XTAL_CLK
         *  1 RC_FAST_CLK
         *  2: PLL_F96M_CLK
         */
        uint32_t mspi_func_clk_sel:2;
        /** mspi_func_clk_en : R/W; bitpos: [10]; default: 1;
         *  Set 1 to enable mspi func clock
         */
        uint32_t mspi_func_clk_en:1;
        /** mspi_axi_rst_en : R/W; bitpos: [11]; default: 0;
         *  Set 1 to reset axi_clock domain of mspi module
         */
        uint32_t mspi_axi_rst_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} pcr_mspi_clk_conf_reg_t;

/** Type of mspi_mem_lp_ctrl register
 *  MSPI memory power control register
 */
typedef union {
    struct {
        /** mspi_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures mspi memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t mspi_mem_lp_mode:2;
        /** mspi_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down mspi memory.
         */
        uint32_t mspi_mem_lp_en:1;
        /** mspi_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control mspi memory, disable hardware control.
         */
        uint32_t mspi_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_mspi_mem_lp_ctrl_reg_t;

/** Type of i2c0_conf register
 *  I2C configuration register
 */
typedef union {
    struct {
        /** i2c0_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable i2c0 apb clock
         */
        uint32_t i2c0_clk_en:1;
        /** i2c0_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset i2c0 module
         */
        uint32_t i2c0_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_i2c0_conf_reg_t;

