espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_struct.h
/** Type of i2c0_sclk_conf register
 *  I2C_SCLK configuration register
 */
typedef union {
    struct {
        /** i2c0_sclk_div_a : R/W; bitpos: [5:0]; default: 0;
         *  The  denominator of the frequency divider factor of the i2c0 function clock.
         */
        uint32_t i2c0_sclk_div_a:6;
        /** i2c0_sclk_div_b : R/W; bitpos: [11:6]; default: 0;
         *  The numerator of the frequency divider factor of the i2c0 function clock.
         */
        uint32_t i2c0_sclk_div_b:6;
        /** i2c0_sclk_div_num : R/W; bitpos: [19:12]; default: 0;
         *  The integral part of the frequency divider factor of the i2c0 function clock.
         */
        uint32_t i2c0_sclk_div_num:8;
        /** i2c0_sclk_sel : R/W; bitpos: [20]; default: 0;
         *  Configures the clock source of I2C.
         *  0 (default): XTAL_CLK
         *  1: RC_FAST_CLK
         */
        uint32_t i2c0_sclk_sel:1;
        uint32_t reserved_21:1;
        /** i2c0_sclk_en : R/W; bitpos: [22]; default: 0;
         *  Set 1 to enable i2c function clock
         */
        uint32_t i2c0_sclk_en:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} pcr_i2c0_sclk_conf_reg_t;

/** Type of twai0_conf register
 *  TWAI0 configuration register
 */
typedef union {
    struct {
        /** twai0_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable twai0 apb clock
         */
        uint32_t twai0_clk_en:1;
        /** twai0_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset twai0 module
         */
        uint32_t twai0_rst_en:1;
        /** twai0_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset twai0 module
         */
        uint32_t twai0_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_twai0_conf_reg_t;

/** Type of twai0_func_clk_conf register
 *  TWAI0_FUNC_CLK configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** twai0_func_clk_sel : R/W; bitpos: [21:20]; default: 0;
         *  Configures the clock source of TWAI0.
         *  0 (default): XTAL_CLK
         *  1: RC_FAST_CLK
         *  2: PLL_F96M_CLK
         */
        uint32_t twai0_func_clk_sel:2;
        /** twai0_func_clk_en : R/W; bitpos: [22]; default: 0;
         *  Set 1 to enable twai0 function clock
         */
        uint32_t twai0_func_clk_en:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} pcr_twai0_func_clk_conf_reg_t;

/** Type of uhci_conf register
 *  UHCI configuration register
 */
typedef union {
    struct {
        /** uhci_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable uhci clock
         */
        uint32_t uhci_clk_en:1;
        /** uhci_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset uhci module
         */
        uint32_t uhci_rst_en:1;
        /** uhci_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset uhci module
         */
        uint32_t uhci_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_uhci_conf_reg_t;

/** Type of rmt_conf register
 *  RMT configuration register
 */
typedef union {
    struct {
        /** rmt_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable rmt apb clock
         */
        uint32_t rmt_clk_en:1;
        /** rmt_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset rmt module
         */
        uint32_t rmt_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_rmt_conf_reg_t;

/** Type of rmt_sclk_conf register
 *  RMT_SCLK configuration register
 */
typedef union {
    struct {
        /** rmt_sclk_div_a : R/W; bitpos: [5:0]; default: 0;
         *  The  denominator of the frequency divider factor of the rmt function clock.
         */
        uint32_t rmt_sclk_div_a:6;
        /** rmt_sclk_div_b : R/W; bitpos: [11:6]; default: 0;
         *  The numerator of the frequency divider factor of the rmt function clock.
         */
        uint32_t rmt_sclk_div_b:6;
        /** rmt_sclk_div_num : R/W; bitpos: [19:12]; default: 1;
         *  The integral part of the frequency divider factor of the rmt function clock.
         */
        uint32_t rmt_sclk_div_num:8;
        /** rmt_sclk_sel : R/W; bitpos: [20]; default: 1;
         *  Configures the clock source of RMT.
         *  0: XTAL_CLK
         *  1 (default): RC_FAST_CLK
         *  2: PLL_F48M_CLK
         */
        uint32_t rmt_sclk_sel:1;
        /** rmt_sclk_en : R/W; bitpos: [21]; default: 0;
         *  Set 1 to enable rmt function clock
         */
        uint32_t rmt_sclk_en:1;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} pcr_rmt_sclk_conf_reg_t;

/** Type of rmt_mem_lp_ctrl register
 *  RMT memory power control register
 */
typedef union {
    struct {
        /** rmt_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures rmt memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t rmt_mem_lp_mode:2;
        /** rmt_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down rmt memory.
         */
        uint32_t rmt_mem_lp_en:1;
        /** rmt_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control rmt memory, disable hardware control.
         */
        uint32_t rmt_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_rmt_mem_lp_ctrl_reg_t;

/** Type of ledc_conf register
 *  LEDC configuration register
 */
typedef union {
    struct {
        /** ledc_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable ledc apb clock
         */
        uint32_t ledc_clk_en:1;
        /** ledc_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset ledc module
         */
        uint32_t ledc_rst_en:1;
        /** ledc_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset ledc module
         */
        uint32_t ledc_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_ledc_conf_reg_t;

