espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_struct.h
/** Type of trace_conf register
 *  TRACE configuration register
 */
typedef union {
    struct {
        /** trace_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable core0 trace clock
         */
        uint32_t trace_clk_en:1;
        /** trace_rst_en : R/W; bitpos: [1]; default: 1;
         *  Set 1 to reset core0 trace module
         */
        uint32_t trace_rst_en:1;
        /** trace1_clk_en : R/W; bitpos: [2]; default: 0;
         *  Set 1 to enable core1 trace clock
         */
        uint32_t trace1_clk_en:1;
        /** trace1_rst_en : R/W; bitpos: [3]; default: 1;
         *  Set 1 to reset core1 trace module
         */
        uint32_t trace1_rst_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_trace_conf_reg_t;

/** Type of assist_conf register
 *  ASSIST configuration register
 */
typedef union {
    struct {
        /** assist_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable core0 assist clock
         */
        uint32_t assist_clk_en:1;
        /** assist_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset core0 assist module
         */
        uint32_t assist_rst_en:1;
        /** assist1_clk_en : R/W; bitpos: [2]; default: 0;
         *  Set 1 to enable core1 assist clock
         */
        uint32_t assist1_clk_en:1;
        /** assist1_rst_en : R/W; bitpos: [3]; default: 1;
         *  Set 1 to reset core1 assist module
         */
        uint32_t assist1_rst_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_assist_conf_reg_t;

/** Type of cache_conf register
 *  CACHE configuration register
 */
typedef union {
    struct {
        /** icache0_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable icache0 clock
         */
        uint32_t icache0_clk_en:1;
        /** icache1_clk_en : R/W; bitpos: [1]; default: 1;
         *  Set 1 to enable icache1 clock
         */
        uint32_t icache1_clk_en:1;
        /** dcache_clk_en : R/W; bitpos: [2]; default: 1;
         *  Set 1 to enable dcache clock
         */
        uint32_t dcache_clk_en:1;
        /** icache0_rst_en : R/W; bitpos: [3]; default: 0;
         *  Set 1 to reset icache0 module
         */
        uint32_t icache0_rst_en:1;
        /** icache1_rst_en : R/W; bitpos: [4]; default: 0;
         *  Set 1 to reset icache1 module
         */
        uint32_t icache1_rst_en:1;
        /** dcache_rst_en : R/W; bitpos: [5]; default: 0;
         *  Set 1 to reset dcache module
         */
        uint32_t dcache_rst_en:1;
        uint32_t reserved_6:2;
        /** cache_rst_en : R/W; bitpos: [8]; default: 0;
         *  Set 1 to reset total cache module
         */
        uint32_t cache_rst_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} pcr_cache_conf_reg_t;

/** Type of cache_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** l1_cache_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures l1_cache memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t l1_cache_mem_lp_mode:2;
        /** l1_cache_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down l1_cache memory.
         */
        uint32_t l1_cache_mem_lp_en:1;
        /** l1_cache_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control l1_cache memory, disable hardware control.
         */
        uint32_t l1_cache_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_cache_mem_lp_ctrl_reg_t;

/** Type of modem_conf register
 *  MODEM_APB configuration register
 */
typedef union {
    struct {
        /** modem_clk_sel : R/W; bitpos: [0]; default: 0;
         *  xxxx
         */
        uint32_t modem_clk_sel:1;
        /** modem_clk_en : R/W; bitpos: [1]; default: 1;
         *  xxxx
         */
        uint32_t modem_clk_en:1;
        /** modem_rst_en : R/W; bitpos: [2]; default: 0;
         *  Set this file as 1 to reset modem-subsystem.
         */
        uint32_t modem_rst_en:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_modem_conf_reg_t;

/** Type of timeout_conf register
 *  TIMEOUT configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:1;
        /** cpu_timeout_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset cpu_peri timeout module
         */
        uint32_t cpu_timeout_rst_en:1;
        /** hp_timeout_rst_en : R/W; bitpos: [2]; default: 0;
         *  Set 1 to reset hp_peri timeout module and hp_modem timeout module
         */
        uint32_t hp_timeout_rst_en:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_timeout_conf_reg_t;

/** Type of sysclk_conf register
 *  SYSCLK configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** soc_clk_sel : R/W; bitpos: [17:16]; default: 0;
         *  Configures to select the clock source of HP_ROOT_CLK.
         *  0 (default): XTAL_CLK
         *  1: RC_FAST_CLK
         *  2: PLL_F160M_CLK
         *  2: PLL_F240M_CLK
         */
        uint32_t soc_clk_sel:2;
        uint32_t reserved_18:6;
        /** clk_xtal_freq : HRO; bitpos: [30:24]; default: 32;
         *  This field indicates the frequency(MHz) of XTAL.
         */
        uint32_t clk_xtal_freq:7;
        /** cpu_dbgmd_clk_en : R/W; bitpos: [31]; default: 1;
         *  This field indicates if cpu debug mode clock is enable. 0: disable, 1:
         *  enable(default).
         */
        uint32_t cpu_dbgmd_clk_en:1;
    };
    uint32_t val;
} pcr_sysclk_conf_reg_t;

/** Type of cpu_waiti_conf register
 *  CPU_WAITI configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:3;
        /** cpu1_wait_mode_force_on : R/W; bitpos: [3]; default: 1;
         *  Set 1 to force cpu1_waiti_clk enable.
         */
        uint32_t cpu1_wait_mode_force_on:1;
        /** cpu0_wait_mode_force_on : R/W; bitpos: [4]; default: 1;
         *  Set 1 to force cpu0_waiti_clk enable.
         */
        uint32_t cpu0_wait_mode_force_on:1;
        /** cpu_waiti_delay_num : R/W; bitpos: [8:5]; default: 0;
         *  This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk
         *  will close
         */
        uint32_t cpu_waiti_delay_num:4;
        /** cpu_wfi_decrease_en : R/W; bitpos: [9]; default: 0;
         *  Set 1 to enable cpu freq decrease to ahb freq when cpu enter waiti mode
         */
        uint32_t cpu_wfi_decrease_en:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} pcr_cpu_waiti_conf_reg_t;

/** Type of cpu_freq_conf register
 *  CPU_FREQ configuration register
 */
typedef union {
    struct {
        /** cpu_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Set this field to generate clk_cpu derived by clk_hproot. The clk_cpu is
         *  div1(default)/div2/div4 of clk_hproot. This field is only available for low-speed
         *  clock-source such as XTAL/FOSC, and should be used together with PCR_AHB_DIV_NUM.
         */
        uint32_t cpu_div_num:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} pcr_cpu_freq_conf_reg_t;

/** Type of ahb_freq_conf register
 *  AHB_FREQ configuration register
 */
typedef union {
    struct {
        /** ahb_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Set this field to generate clk_ahb derived by clk_hproot. The clk_ahb is
         *  div1(default)/div2/div4/div8 of clk_hproot. This field is only available for
         *  low-speed clock-source such as XTAL/FOSC, and should be used together with
         *  PCR_CPU_DIV_NUM.
         */
        uint32_t ahb_div_num:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} pcr_ahb_freq_conf_reg_t;

/** Type of apb_freq_conf register
 *  APB_FREQ configuration register
 */
typedef union {
    struct {
        /** apb_decrease_div_num : R/W; bitpos: [7:0]; default: 0;
         *  If this field's value is grater than PCR_APB_DIV_NUM, the clk_apb will be
         *  automatically down to clk_apb_decrease only when no access is on apb-bus, and will
         *  recover to the previous frequency when a new access appears on apb-bus. Set as one
         *  within (0,1,3) to set clk_apb_decrease as div1/div2/div4(default) of clk_ahb. Note
         *  that enable this function will reduce performance. Users can set this field as zero
         *  to disable the auto-decrease-apb-freq function. By default, this function is
         *  disable.
         */
        uint32_t apb_decrease_div_num:8;
        /** apb_div_num : R/W; bitpos: [15:8]; default: 0;
         *  Set as one within (0,1,3) to generate clk_apb derived by clk_ahb. The clk_apb is
         *  div1(default)/div2/div4 of clk_ahb.
         */
        uint32_t apb_div_num:8;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} pcr_apb_freq_conf_reg_t;

/** Type of pll_div_clk_en register
 *  SPLL DIV clock-gating configuration register
 */
typedef union {
    struct {
        /** pll_96m_clk_en : R/W; bitpos: [0]; default: 1;
         *  This field is used to open 96 MHz clock  derived from SPLL 96M. 0: close, 1:
         *  open(default). Only available when high-speed clock-source SPLL is active.
         */
        uint32_t pll_96m_clk_en:1;
        /** pll_64m_clk_en : R/W; bitpos: [1]; default: 1;
         *  This field is used to open 64 MHz clock derived from SPLL 64M. 0: close, 1:
         *  open(default). Only available when high-speed clock-source SPLL is active.
         */
        uint32_t pll_64m_clk_en:1;
        /** pll_48m_clk_en : R/W; bitpos: [2]; default: 1;
         *  This field is used to open 48 MHz clock (div2 of SPLL) derived from SPLL 96M. 0:
         *  close, 1: open(default). Only available when high-speed clock-source SPLL is active.
         */
        uint32_t pll_48m_clk_en:1;
        /** pll_32m_clk_en : R/W; bitpos: [3]; default: 1;
         *  This field is used to open 32 MHz clock (div2  of SPLL) derived from SPLL 64M. 0:
         *  close, 1: open(default). Only available when high-speed clock-source SPLL is active.
         */
        uint32_t pll_32m_clk_en:1;
        /** pll_16m_clk_en : R/W; bitpos: [4]; default: 1;
         *  This field is used to open 16 MHz clock (div6 of SPLL) derived from SPLL 96M. 0:
         *  close, 1: open(default). Only available when high-speed clock-source SPLL is active.
         */
        uint32_t pll_16m_clk_en:1;
        /** pll_8m_clk_en : R/W; bitpos: [5]; default: 1;
         *  This field is used to open   8 MHz clock (div12 of SPLL) derived from SPLL 96M. 0:
         *  close, 1: open(default). Only available when high-speed clock-source SPLL is active.
         */
        uint32_t pll_8m_clk_en:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} pcr_pll_div_clk_en_reg_t;

