espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_struct.h
/** Type of ctrl_clk_out_en register
 *  CLK_OUT_EN configuration register
 */
typedef union {
    struct {
        /** clk8_oen : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable 8m clock
         */
        uint32_t clk8_oen:1;
        /** clk16_oen : R/W; bitpos: [1]; default: 1;
         *  Set 1 to enable 16m clock
         */
        uint32_t clk16_oen:1;
        /** clk32_oen : R/W; bitpos: [2]; default: 1;
         *  Set 1 to enable 32m clock
         */
        uint32_t clk32_oen:1;
        /** clk_adc_inf_oen : R/W; bitpos: [3]; default: 1;
         *  Reserved
         */
        uint32_t clk_adc_inf_oen:1;
        /** clk_dfm_inf_oen : R/W; bitpos: [4]; default: 1;
         *  Reserved
         */
        uint32_t clk_dfm_inf_oen:1;
        /** clk_sdm_mod_oen : R/W; bitpos: [5]; default: 1;
         *  Reserved
         */
        uint32_t clk_sdm_mod_oen:1;
        /** clk_xtal_oen : R/W; bitpos: [6]; default: 1;
         *  Set 1 to enable xtal clock
         */
        uint32_t clk_xtal_oen:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} pcr_ctrl_clk_out_en_reg_t;

/** Type of timg_cali_clk_conf register
 *  timergrout calibrate clock configuration register
 */
typedef union {
    struct {
        /** timg_cali_clk_sel : R/W; bitpos: [2:0]; default: 0;
         *  Configures the 32KHz clock for TIMER_GROUP.
         *  0 (default): RC32K_CLK
         *  1: XTAL32K_CLK
         *  2: OSC_SLOW_CLK
         *  3: RC_SLOW_CLK
         *  4: TIMG_SECURE_CLK
         */
        uint32_t timg_cali_clk_sel:3;
        uint32_t reserved_3:1;
        /** timg_secure_clk_sel : R/W; bitpos: [7:4]; default: 7;
         *  Configures the clock source for the TIMG_SECURE_CLK.
         *  0: EXT_IO_CLK
         *  1: CPU_CLK
         *  2: AHB_CLK
         *  3: APB_CLK
         *  4: sec function clock
         *  5: mspi function clock
         *  6: iomux function clock
         *  7: parl io rx function clock
         *  8: parl io tx function clock
         *  9: spi3 function clock
         *  10: spi2 function clock
         *  11: RC_FAST_CLK
         */
        uint32_t timg_secure_clk_sel:4;
        /** timg_secure_clk_div_num : R/W; bitpos: [15:8]; default: 7;
         *  When PCR_TIMG_CALI_CLK_SEL set as 4, This field PCR_TIMG_SECURE_CLK_DIV_NUM is used
         *  to set the divider number of TIMG_SECURE_CLK.
         */
        uint32_t timg_secure_clk_div_num:8;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} pcr_timg_cali_clk_conf_reg_t;

/** Type of rom_mem_lp_ctrl register
 *  rom power control register
 */
typedef union {
    struct {
        /** internal_rom_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures rom low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t internal_rom_mem_lp_mode:2;
        /** internal_rom_mem_lp_en : R/W; bitpos: [3:2]; default: 0;
         *  Set this bit to power down rom.
         */
        uint32_t internal_rom_mem_lp_en:2;
        /** internal_rom_mem_force_ctrl : R/W; bitpos: [5:4]; default: 0;
         *  Set this bit to force software control rom, disable hardware control.
         */
        uint32_t internal_rom_mem_force_ctrl:2;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} pcr_rom_mem_lp_ctrl_reg_t;

/** Type of sram_power_conf_1 register
 *  HP SRAM/ROM configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** sram_clkgate_force_on : R/W; bitpos: [26:20]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the SRAM. 0: A
         *  gate-clock will be used when accessing the SRAM.
         */
        uint32_t sram_clkgate_force_on:7;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} pcr_sram_power_conf_1_reg_t;

/** Type of sec_conf register
 *  Clock source configuration register for External Memory Encryption and Decryption
 */
typedef union {
    struct {
        /** sec_clk_sel : R/W; bitpos: [1:0]; default: 0;
         *  Configures the clock source for the External Memory Encryption and Decryption
         *  module.
         *  0(default): XTAL_CLK
         *  1: RC_FAST_CLK
         *  2: PLL_F64M_CLK
         *  3: PLL_F96M_CLK
         */
        uint32_t sec_clk_sel:2;
        /** sec_rst_en : R/W; bitpos: [2]; default: 0;
         *  Set 1 to reset sec module
         */
        uint32_t sec_rst_en:1;
        /** sec_div_numinator : R/W; bitpos: [6:3]; default: 0;
         *  The  denominator of the frequency divider factor of the sec function clock.
         */
        uint32_t sec_div_numinator:4;
        /** sec_div_denominator : R/W; bitpos: [10:7]; default: 0;
         *  The numerator of the frequency divider factor of the sec function clock.
         */
        uint32_t sec_div_denominator:4;
        /** sec_div_num : R/W; bitpos: [14:11]; default: 0;
         *  The integral part of the frequency divider factor of the sec function clock.
         */
        uint32_t sec_div_num:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} pcr_sec_conf_reg_t;

/** Type of bus_clk_update register
 *  Configuration register for applying updated high-performance system clock sources
 */
typedef union {
    struct {
        /** bus_clock_update : R/W/WTC; bitpos: [0]; default: 0;
         *  Configures whether or not to update configurations for CPU_CLK division, AHB_CLK
         *  division and HP_ROOT_CLK clock source selection.
         *  0: Not update configurations
         *  1: Update configurations
         *  This bit is automatically cleared when configurations have been updated.
         */
        uint32_t bus_clock_update:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} pcr_bus_clk_update_reg_t;

/** Type of sar_clk_div register
 *  SAR ADC clock divisor configuration register
 */
typedef union {
    struct {
        /** sar2_clk_div_num : R/W; bitpos: [7:0]; default: 15;
         *  Configures the divisor for SAR ADC 2  clock to generate ADC analog control signals.
         */
        uint32_t sar2_clk_div_num:8;
        /** sar1_clk_div_num : R/W; bitpos: [15:8]; default: 15;
         *  Configures the divisor for SAR ADC 1  clock to generate ADC analog control signals.
         */
        uint32_t sar1_clk_div_num:8;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} pcr_sar_clk_div_reg_t;

/** Type of pwdet_sar_clk_conf register
 *  xxxx
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** pwdet_sar_reader_en : R/W; bitpos: [8]; default: 1;
         *  xxxx
         */
        uint32_t pwdet_sar_reader_en:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} pcr_pwdet_sar_clk_conf_reg_t;

/** Type of timergroup_wdt_conf register
 *  TIMERGROUP_WDT configuration register
 */
typedef union {
    struct {
        /** tg0_wdt_rst_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to reset timer_group0 wdt module
         */
        uint32_t tg0_wdt_rst_en:1;
        /** tg1_wdt_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset timer_group1 wdt module
         */
        uint32_t tg1_wdt_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_timergroup_wdt_conf_reg_t;

/** Type of timergroup_xtal_conf register
 *  TIMERGROUP1 configuration register
 */
typedef union {
    struct {
        /** tg0_xtal_rst_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to reset timer_group0 xtal clock domain
         */
        uint32_t tg0_xtal_rst_en:1;
        /** tg1_xtal_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset timer_group1 xtal clock domain
         */
        uint32_t tg1_xtal_rst_en:1;
        /** tg0_xtal_clk_en : R/W; bitpos: [2]; default: 1;
         *  Set 1 to enable tg0 xtal clock
         */
        uint32_t tg0_xtal_clk_en:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_timergroup_xtal_conf_reg_t;

