espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_struct.h
/** Type of km_conf register
 *  Key Manager configuration register
 */
typedef union {
    struct {
        /** km_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable km clock
         */
        uint32_t km_clk_en:1;
        /** km_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset km module
         */
        uint32_t km_rst_en:1;
        /** km_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset km module
         */
        uint32_t km_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_km_conf_reg_t;

/** Type of km_mem_lp_ctrl register
 *  KM memory power control register
 */
typedef union {
    struct {
        /** km_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures km memory low power mode in low power stage.
         *  0: deep sleep
         *  1: light sleep
         *  2(default): shut down
         *  3: disable low power stage
         */
        uint32_t km_mem_lp_mode:2;
        /** km_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down km memory.
         */
        uint32_t km_mem_lp_en:1;
        /** km_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control km memory, disable hardware control.
         */
        uint32_t km_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_km_mem_lp_ctrl_reg_t;

/** Type of tcm_mem_monitor_conf register
 *  TCM_MEM_MONITOR configuration register
 */
typedef union {
    struct {
        /** tcm_mem_monitor_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable tcm_mem_monitor clock
         */
        uint32_t tcm_mem_monitor_clk_en:1;
        /** tcm_mem_monitor_rst_en : R/W; bitpos: [1]; default: 1;
         *  Set 1 to reset tcm_mem_monitor module
         */
        uint32_t tcm_mem_monitor_rst_en:1;
        /** tcm_mem_monitor_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset tcm_mem_monitor module
         */
        uint32_t tcm_mem_monitor_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_tcm_mem_monitor_conf_reg_t;

/** Type of psram_mem_monitor_conf register
 *  PSRAM_MEM_MONITOR configuration register
 */
typedef union {
    struct {
        /** psram_mem_monitor_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable psram_mem_monitor clock
         */
        uint32_t psram_mem_monitor_clk_en:1;
        /** psram_mem_monitor_rst_en : R/W; bitpos: [1]; default: 1;
         *  Set 1 to reset psram_mem_monitor module
         */
        uint32_t psram_mem_monitor_rst_en:1;
        /** psram_mem_monitor_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset psram_mem_monitor module
         */
        uint32_t psram_mem_monitor_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_psram_mem_monitor_conf_reg_t;

/** Type of reset_event_bypass register
 *  reset event bypass backdoor configuration register
 */
typedef union {
    struct {
        /** reset_event_bypass_tee_apm : R/W; bitpos: [0]; default: 0;
         *  This field is used to control reset event relationship for tee_apm. 1: tee_apm will
         *  only be reset by power-reset. some reset event will be bypass. 0:tee_apm will not
         *  only be reset by power-reset, but also some reset event.
         */
        uint32_t reset_event_bypass_tee_apm:1;
        /** reset_event_bypass_pcr : R/W; bitpos: [1]; default: 0;
         *  This field is used to control reset event relationship for pcr. 1: pcr will only be
         *  reset by power-reset. some reset event will be bypass. 0:pcr will not only be reset
         *  by power-reset, but also some reset event.
         */
        uint32_t reset_event_bypass_pcr:1;
        /** reset_event_bypass_hpsysreg : R/W; bitpos: [2]; default: 0;
         *  This field is used to control reset event relationship for hpsysreg. 1: hpsysreg
         *  will only be reset by power-reset. some reset event will be bypass. 0:hpsysreg will
         *  not only be reset by power-reset, but also some reset event.
         */
        uint32_t reset_event_bypass_hpsysreg:1;
        /** reset_event_bypass_iomux : R/W; bitpos: [3]; default: 0;
         *  This field is used to control reset event relationship for iomux. 1: iomux will
         *  only be reset by power-reset. some reset event will be bypass. 0:iomux will not
         *  only be reset by power-reset, but also some reset event.
         */
        uint32_t reset_event_bypass_iomux:1;
        /** reset_event_bypass_intmtx0 : R/W; bitpos: [4]; default: 0;
         *  This field is used to control reset event relationship for intmtx0. 1: intmtx0 will
         *  only be reset by power-reset. some reset event will be bypass. 0:intmtx0 will not
         *  only be reset by power-reset, but also some reset event.
         */
        uint32_t reset_event_bypass_intmtx0:1;
        /** reset_event_bypass_intmtx1 : R/W; bitpos: [5]; default: 0;
         *  This field is used to control reset event relationship for intmtx1. 1: intmtx1 will
         *  only be reset by power-reset. some reset event will be bypass. 0:intmtx1 will not
         *  only be reset by power-reset, but also some reset event.
         */
        uint32_t reset_event_bypass_intmtx1:1;
        /** reset_event_bypass_modem : R/W; bitpos: [6]; default: 0;
         *  This field is used to control reset event relationship for modem. 1: modem will
         *  only be reset by power-reset. some reset event will be bypass. 0:modem will not
         *  only be reset by power-reset, but also some reset event.
         */
        uint32_t reset_event_bypass_modem:1;
        /** reset_event_bypass_bus_modem : R/W; bitpos: [7]; default: 0;
         *  This field is used to control reset event relationship for bus_modem. 1: bus_modem
         *  will only be reset by power-reset. some reset event will be bypass. 0:bus_modem
         *  will not only be reset by power-reset, but also some reset event.
         */
        uint32_t reset_event_bypass_bus_modem:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} pcr_reset_event_bypass_reg_t;

/** Type of hpcore_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** hpcore_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t hpcore_mem_lp_mode:2;
        /** hpcore_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down HP CORE0 & HP CORE1 memory.
         */
        uint32_t hpcore_mem_lp_en:1;
        /** hpcore_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control HP CORE0 & HP CORE1 memory, disable hardware
         *  control.
         */
        uint32_t hpcore_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_hpcore_mem_lp_ctrl_reg_t;

