espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_struct.h
/** Type of usb_otg11_conf register
 *  USB_OTG configuration register
 */
typedef union {
    struct {
        /** usb_otg11_clk_en : R/W; bitpos: [0]; default: 1;
         *  Set 1 to enable usb_otg11 clock
         */
        uint32_t usb_otg11_clk_en:1;
        /** usb_otg11_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset usb_otg11 module
         */
        uint32_t usb_otg11_rst_en:1;
        /** usb_otg11_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset usb_otg11 module
         */
        uint32_t usb_otg11_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_usb_otg11_conf_reg_t;

/** Type of usb_otg11_mem_lp_ctrl register
 *  USB_OTG11 memory power control register
 */
typedef union {
    struct {
        /** usb_otg11_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures usb_otg11 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t usb_otg11_mem_lp_mode:2;
        /** usb_otg11_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down usb_otg11 memory.
         */
        uint32_t usb_otg11_mem_lp_en:1;
        /** usb_otg11_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control usb_otg11 memory, disable hardware control.
         */
        uint32_t usb_otg11_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_usb_otg11_mem_lp_ctrl_reg_t;

/** Type of core1_conf register
 *  USB_OTG configuration register
 */
typedef union {
    struct {
        /** core1_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable core1 clock
         */
        uint32_t core1_clk_en:1;
        /** core1_rst_en : R/W; bitpos: [1]; default: 1;
         *  Set 1 to reset core1 module
         */
        uint32_t core1_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_core1_conf_reg_t;

/** Type of i2c1_conf register
 *  I2C configuration register
 */
typedef union {
    struct {
        /** i2c1_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable i2c1 apb clock
         */
        uint32_t i2c1_clk_en:1;
        /** i2c1_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset i2c1 module
         */
        uint32_t i2c1_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_i2c1_conf_reg_t;

/** Type of i2c1_sclk_conf register
 *  I2C_SCLK configuration register
 */
typedef union {
    struct {
        /** i2c1_sclk_div_a : R/W; bitpos: [5:0]; default: 0;
         *  The  denominator of the frequency divider factor of the i2c1 function clock.
         */
        uint32_t i2c1_sclk_div_a:6;
        /** i2c1_sclk_div_b : R/W; bitpos: [11:6]; default: 0;
         *  The numerator of the frequency divider factor of the i2c1 function clock.
         */
        uint32_t i2c1_sclk_div_b:6;
        /** i2c1_sclk_div_num : R/W; bitpos: [19:12]; default: 0;
         *  The integral part of the frequency divider factor of the i2c1 function clock.
         */
        uint32_t i2c1_sclk_div_num:8;
        /** i2c1_sclk_sel : R/W; bitpos: [20]; default: 0;
         *  Configures the clock source of I2C.
         *  0 (default): XTAL_CLK
         *  1: RC_FAST_CLK
         */
        uint32_t i2c1_sclk_sel:1;
        uint32_t reserved_21:1;
        /** i2c1_sclk_en : R/W; bitpos: [22]; default: 0;
         *  Set 1 to enable i2c function clock
         */
        uint32_t i2c1_sclk_en:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} pcr_i2c1_sclk_conf_reg_t;

/** Type of pwm1_conf register
 *  PWM1 configuration register
 */
typedef union {
    struct {
        /** pwm1_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable pwm1 clock
         */
        uint32_t pwm1_clk_en:1;
        /** pwm1_rst_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to reset pwm1 module
         */
        uint32_t pwm1_rst_en:1;
        /** pwm1_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset pwm1 module
         */
        uint32_t pwm1_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_pwm1_conf_reg_t;

/** Type of pwm1_clk_conf register
 *  PWM1_CLK configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** pwm1_div_num : R/W; bitpos: [19:12]; default: 4;
         *  The integral part of the frequency divider factor of the pwm1 function clock.
         */
        uint32_t pwm1_div_num:8;
        /** pwm1_clkm_sel : R/W; bitpos: [21:20]; default: 0;
         *  Configures the clock source of MCPWM1.
         *  0 (default): XTAL_CLK
         *  1: RC_FAST_CLK
         *  2: PLL_F160M_CLK
         */
        uint32_t pwm1_clkm_sel:2;
        /** pwm1_clkm_en : R/W; bitpos: [22]; default: 0;
         *  set this field as 1 to activate pwm1 clkm.
         */
        uint32_t pwm1_clkm_en:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} pcr_pwm1_clk_conf_reg_t;

/** Type of spi3_conf register
 *  SPI3 configuration register
 */
typedef union {
    struct {
        /** spi3_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable spi3 apb clock
         */
        uint32_t spi3_clk_en:1;
        /** spi3_rst_en : R/W; bitpos: [1]; default: 1;
         *  Set 1 to reset spi3 module
         */
        uint32_t spi3_rst_en:1;
        /** spi3_ready : RO; bitpos: [2]; default: 1;
         *  Query this field after reset spi3 module
         */
        uint32_t spi3_ready:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} pcr_spi3_conf_reg_t;

/** Type of spi3_clkm_conf register
 *  SPI3_CLKM configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** spi3_clkm_div_num : R/W; bitpos: [19:12]; default: 0;
         *  The integral part of the frequency divider factor of the spi3_mst clock.
         */
        uint32_t spi3_clkm_div_num:8;
        /** spi3_clkm_sel : R/W; bitpos: [21:20]; default: 0;
         *  Configures the clock source of SPI3.
         *  0 (default): XTAL_CLK
         *  1: PLL_F160M_CLK
         *  2: RC_FAST_CLK
         *  3: PLL_F120M_CLK
         */
        uint32_t spi3_clkm_sel:2;
        /** spi3_clkm_en : R/W; bitpos: [22]; default: 0;
         *  Set 1 to enable spi3 function clock
         */
        uint32_t spi3_clkm_en:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} pcr_spi3_clkm_conf_reg_t;

/** Type of asrc_func_clk_conf register
 *  AUDIO_SAMPLE_RATE_FUNC_CLK configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:22;
        /** asrc_apb_clk_en : R/W; bitpos: [22]; default: 1;
         *  Set 1 to enable audio_sample rate converter apb clock
         */
        uint32_t asrc_apb_clk_en:1;
        /** asrc_func_clk_en : R/W; bitpos: [23]; default: 1;
         *  Set 1 to enable audio_sample rate converter function clock
         */
        uint32_t asrc_func_clk_en:1;
        /** asrc_rst_en : R/W; bitpos: [24]; default: 0;
         *  Set 1 to reset audio_sample_rate_converter module
         */
        uint32_t asrc_rst_en:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} pcr_asrc_func_clk_conf_reg_t;

/** Type of bus_clock_gate_bypass register
 *  bus clock gating bypass configuration register
 */
typedef union {
    struct {
        /** ahb_clk_gating_bypass : R/W; bitpos: [0]; default: 1;
         *  Set 1 to bypass the clock gating for ahb bus
         */
        uint32_t ahb_clk_gating_bypass:1;
        /** apb_clk_gating_bypass : R/W; bitpos: [1]; default: 1;
         *  Set 1 to bypass the clock gating for apb bus
         */
        uint32_t apb_clk_gating_bypass:1;
        /** axi_clk_gating_bypass : R/W; bitpos: [2]; default: 1;
         *  Set 1 to bypass the clock gating for axi bus
         */
        uint32_t axi_clk_gating_bypass:1;
        /** mem_clk_gating_bypass : R/W; bitpos: [3]; default: 1;
         *  Set 1 to bypass the clock gating for mem bus
         */
        uint32_t mem_clk_gating_bypass:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} pcr_bus_clock_gate_bypass_reg_t;

/** Type of zero_det_conf register
 *  ZERO_DET configuration register
 */
typedef union {
    struct {
        /** zero_det_clk_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable zero_det apb clock
         */
        uint32_t zero_det_clk_en:1;
        /** zero_det_rst_en : R/W; bitpos: [1]; default: 1;
         *  Set 1 to reset zero_det module
         */
        uint32_t zero_det_rst_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pcr_zero_det_conf_reg_t;

/** Type of zero_det_clk_conf register
 *  ZERO_DET_CLK configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** zero_det_func_clk_sel : R/W; bitpos: [21:20]; default: 0;
         *  Configures the clock source of ZERO DETECT.
         *  0 (default): XTAL_CLK
         *  1: RC_FAST_CLK
         *  2: PLL_F48M_CLK
         */
        uint32_t zero_det_func_clk_sel:2;
        /** zero_det_func_clk_en : R/W; bitpos: [22]; default: 0;
         *  Set 1 to enable zero_det function clock
         */
        uint32_t zero_det_func_clk_en:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} pcr_zero_det_clk_conf_reg_t;

/** Type of rst_en register
 *  PCR clock gating configure register
 */
typedef union {
    struct {
        /** pcr_rst_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to reset pcr module
         */
        uint32_t pcr_rst_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} pcr_rst_en_reg_t;


