espressif/esp-idf/components/soc/esp32h4/register/soc/pcr_struct.h
/** Group: Frequency Statistics Register */
/** Type of sysclk_freq_query_0 register
 *  SYSCLK frequency query 0 register
 */
typedef union {
    struct {
        /** fosc_freq : HRO; bitpos: [7:0]; default: 8;
         *  This field indicates the frequency(MHz) of FOSC.
         */
        uint32_t fosc_freq:8;
        /** pll_freq : HRO; bitpos: [17:8]; default: 96;
         *  This field indicates the frequency(MHz) of SPLL.
         */
        uint32_t pll_freq:10;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} pcr_sysclk_freq_query_0_reg_t;


/** Group: Version Register */
/** Type of date register
 *  Date register.
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 37823024;
         *  PCR version information.
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} pcr_date_reg_t;


typedef struct {
    volatile pcr_uart0_conf_reg_t uart0_conf;
    volatile pcr_uart0_sclk_conf_reg_t uart0_sclk_conf;
    volatile pcr_uart0_mem_lp_ctrl_reg_t uart0_mem_lp_ctrl;
    volatile pcr_uart1_conf_reg_t uart1_conf;
    volatile pcr_uart1_sclk_conf_reg_t uart1_sclk_conf;
    volatile pcr_uart1_mem_lp_ctrl_reg_t uart1_mem_lp_ctrl;
    volatile pcr_mspi_conf_reg_t mspi_conf;
    volatile pcr_mspi_clk_conf_reg_t mspi_clk_conf;
    volatile pcr_mspi_mem_lp_ctrl_reg_t mspi_mem_lp_ctrl;
    volatile pcr_i2c0_conf_reg_t i2c0_conf;
    volatile pcr_i2c0_sclk_conf_reg_t i2c0_sclk_conf;
    volatile pcr_twai0_conf_reg_t twai0_conf;
    volatile pcr_twai0_func_clk_conf_reg_t twai0_func_clk_conf;
    volatile pcr_uhci_conf_reg_t uhci_conf;
    volatile pcr_rmt_conf_reg_t rmt_conf;
    volatile pcr_rmt_sclk_conf_reg_t rmt_sclk_conf;
    volatile pcr_rmt_mem_lp_ctrl_reg_t rmt_mem_lp_ctrl;
    volatile pcr_ledc_conf_reg_t ledc_conf;
    volatile pcr_ledc_sclk_conf_reg_t ledc_sclk_conf;
    uint32_t reserved_04c;
    volatile pcr_timergroup0_conf_reg_t timergroup0_conf;
    volatile pcr_timergroup0_timer_clk_conf_reg_t timergroup0_timer_clk_conf;
    volatile pcr_timergroup0_wdt_clk_conf_reg_t timergroup0_wdt_clk_conf;
    volatile pcr_timergroup1_conf_reg_t timergroup1_conf;
    volatile pcr_timergroup1_timer_clk_conf_reg_t timergroup1_timer_clk_conf;
    volatile pcr_timergroup1_wdt_clk_conf_reg_t timergroup1_wdt_clk_conf;
    volatile pcr_systimer_conf_reg_t systimer_conf;
    volatile pcr_systimer_func_clk_conf_reg_t systimer_func_clk_conf;
    volatile pcr_i2s_conf_reg_t i2s_conf;
    volatile pcr_i2s_tx_clkm_conf_reg_t i2s_tx_clkm_conf;
    volatile pcr_i2s_tx_clkm_div_conf_reg_t i2s_tx_clkm_div_conf;
    volatile pcr_i2s_rx_clkm_conf_reg_t i2s_rx_clkm_conf;
    volatile pcr_i2s_rx_clkm_div_conf_reg_t i2s_rx_clkm_div_conf;
    volatile pcr_saradc_conf_reg_t saradc_conf;
    volatile pcr_saradc_clkm_conf_reg_t saradc_clkm_conf;
    volatile pcr_tsens_clk_conf_reg_t tsens_clk_conf;
    volatile pcr_usb_device_conf_reg_t usb_device_conf;
    volatile pcr_usb_device_mem_lp_ctrl_reg_t usb_device_mem_lp_ctrl;
    volatile pcr_intmtx_conf_reg_t intmtx_conf;
    volatile pcr_pcnt_conf_reg_t pcnt_conf;
    volatile pcr_etm_conf_reg_t etm_conf;
    volatile pcr_pwm0_conf_reg_t pwm0_conf;
    volatile pcr_pwm0_clk_conf_reg_t pwm0_clk_conf;
    volatile pcr_parl_io_conf_reg_t parl_io_conf;
    volatile pcr_parl_clk_rx_conf_reg_t parl_clk_rx_conf;
    volatile pcr_parl_clk_tx_conf_reg_t parl_clk_tx_conf;
    volatile pcr_pvt_monitor_conf_reg_t pvt_monitor_conf;
    volatile pcr_pvt_monitor_func_clk_conf_reg_t pvt_monitor_func_clk_conf;
    volatile pcr_gdma_conf_reg_t gdma_conf;
    volatile pcr_spi2_conf_reg_t spi2_conf;
    volatile pcr_spi2_clkm_conf_reg_t spi2_clkm_conf;
    volatile pcr_aes_conf_reg_t aes_conf;
    volatile pcr_sha_conf_reg_t sha_conf;
    uint32_t reserved_0d4[2];
    volatile pcr_ecc_conf_reg_t ecc_conf;
    volatile pcr_ecc_mem_lp_ctrl_reg_t ecc_mem_lp_ctrl;
    uint32_t reserved_0e4;
    volatile pcr_hmac_conf_reg_t hmac_conf;
    volatile pcr_ecdsa_conf_reg_t ecdsa_conf;
    volatile pcr_iomux_conf_reg_t iomux_conf;
    volatile pcr_iomux_clk_conf_reg_t iomux_clk_conf;
    volatile pcr_regdma_conf_reg_t regdma_conf;
    volatile pcr_trace_conf_reg_t trace_conf;
    volatile pcr_assist_conf_reg_t assist_conf;
    volatile pcr_cache_conf_reg_t cache_conf;
    volatile pcr_cache_mem_lp_ctrl_reg_t cache_mem_lp_ctrl;
    volatile pcr_modem_conf_reg_t modem_conf;
    volatile pcr_timeout_conf_reg_t timeout_conf;
    volatile pcr_sysclk_conf_reg_t sysclk_conf;
    volatile pcr_cpu_waiti_conf_reg_t cpu_waiti_conf;
    volatile pcr_cpu_freq_conf_reg_t cpu_freq_conf;
    volatile pcr_ahb_freq_conf_reg_t ahb_freq_conf;
    volatile pcr_apb_freq_conf_reg_t apb_freq_conf;
    volatile pcr_sysclk_freq_query_0_reg_t sysclk_freq_query_0;
    volatile pcr_pll_div_clk_en_reg_t pll_div_clk_en;
    volatile pcr_ctrl_clk_out_en_reg_t ctrl_clk_out_en;
    volatile pcr_timg_cali_clk_conf_reg_t timg_cali_clk_conf;
    volatile pcr_rom_mem_lp_ctrl_reg_t rom_mem_lp_ctrl;
    volatile pcr_sram_power_conf_1_reg_t sram_power_conf_1;
    volatile pcr_sec_conf_reg_t sec_conf;
    uint32_t reserved_144;
    volatile pcr_bus_clk_update_reg_t bus_clk_update;
    volatile pcr_sar_clk_div_reg_t sar_clk_div;
    volatile pcr_pwdet_sar_clk_conf_reg_t pwdet_sar_clk_conf;
    volatile pcr_timergroup_wdt_conf_reg_t timergroup_wdt_conf;
    uint32_t reserved_158[2];
    volatile pcr_timergroup_xtal_conf_reg_t timergroup_xtal_conf;
    volatile pcr_km_conf_reg_t km_conf;
    volatile pcr_km_mem_lp_ctrl_reg_t km_mem_lp_ctrl;
    volatile pcr_tcm_mem_monitor_conf_reg_t tcm_mem_monitor_conf;  // TODO: [ESP32H4] IDF-12497 , need check
    volatile pcr_psram_mem_monitor_conf_reg_t psram_mem_monitor_conf;
    volatile pcr_reset_event_bypass_reg_t reset_event_bypass;
    volatile pcr_hpcore_mem_lp_ctrl_reg_t hpcore_mem_lp_ctrl;
    volatile pcr_usb_otg11_conf_reg_t usb_otg11_conf;
    volatile pcr_usb_otg11_mem_lp_ctrl_reg_t usb_otg11_mem_lp_ctrl;
    uint32_t reserved_184;
    volatile pcr_core1_conf_reg_t core1_conf;
    volatile pcr_i2c1_conf_reg_t i2c1_conf;
    volatile pcr_i2c1_sclk_conf_reg_t i2c1_sclk_conf;
    volatile pcr_pwm1_conf_reg_t pwm1_conf;
    volatile pcr_pwm1_clk_conf_reg_t pwm1_clk_conf;
    volatile pcr_spi3_conf_reg_t spi3_conf;
    volatile pcr_spi3_clkm_conf_reg_t spi3_clkm_conf;
    uint32_t reserved_1a4;
    volatile pcr_asrc_func_clk_conf_reg_t asrc_func_clk_conf;
    volatile pcr_bus_clock_gate_bypass_reg_t bus_clock_gate_bypass;
    volatile pcr_zero_det_conf_reg_t zero_det_conf;
    volatile pcr_zero_det_clk_conf_reg_t zero_det_clk_conf;
    volatile pcr_rst_en_reg_t rst_en;
    uint32_t reserved_1bc[912];
    volatile pcr_date_reg_t date;
} pcr_dev_t;

extern pcr_dev_t PCR;

#ifndef __cplusplus
_Static_assert(sizeof(pcr_dev_t) == 0x1000, "Invalid size of pcr_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
